{
  "1": {
    "title": "Sort Algorithm Visualization",
    "description": "<p><strong>SortAlgorithm</strong> is a web-based application designed to provide real-time visualizations of popular sorting algorithms such as <b>Merge Sort</b> and <b>Quick Sort</b>.</p>\n  <p>These visualizations make it easier to understand, explore, and learn complex algorithms interactively.</p>\n <p>SortAlgorithm offers an engaging and interactive way to visualize how sorting algorithms work step-by-step. It's especially useful for students, developers, and anyone learning algorithms.</p>",
    "subPoints": [
      {
        "title": "Outcome",
        "des": "<ul>\n  <li>✅ Users can visualize how sorting algorithms work in real-time.</li>\n  <li>✅ Users can learn about the time complexity of each algorithm.</li>\n  <li>✅ A hands-on approach to deepen understanding of sorting techniques.</li>\n  </ul>"
      },
      {
        "title": "Technologies Used",
        "des": "<ul>\n  <li>💻 <b>HTML</b>: To structure the content and layout.</li>\n  <li>🎨 <b>CSS</b>: To style the application and make it visually appealing.</li>\n    <li>⚙️ <b>JavaScript</b>: To implement dynamic sorting animations and interactions.</li>\n  </ul>"
      }
    ],
    "codeLink": "https://github.com/Aryan-Lokhande/Sort-Algorithm",
    "demoLink": "https://aryan-lokhande.github.io/Sort-Algorithm/"
  },
  "3": {
    "title": "API Calls",
    "description": "",
    "codeLink": "",
    "demoLink": ""
  },
  "2": {
    "title": "Mini Projects",
    "description": "This section showcases two interactive mini-projects: the Simon Game and Tic-Tac-Toe. These projects focus on logic, UI/UX, and JavaScript-driven interactivity.",
    "subPoints": [
      {
        "title": "Simon Game",
        "des": "A <b>memory-based game</b> where players must repeat an increasing sequence of lights and sounds.<br> Built using HTML, CSS, and JavaScript to enhance user interaction and logic-building."
      },
      {
        "title": "Tic-Tac-Toe",
        "des": "A classic two-player game simple yet.<br> Developed with JavaScript, featuring a responsive UI and intelligent game logic."
      },
      {
        "title":"Give it a try!"
      }
    ],
    "codeLink": "https://github.com/Aryan-Lokhande/mini_projects",
    "demoLink": "https://aryan-lokhande.github.io/mini_projects/"
  }
}
